/**
 * Эта функция показывает interstitial рекламу и обрабатывает события жизненного цикла с помощью коллбэков.
 */
export const showInterstitialAd = () => {
  if (typeof window === 'undefined' || !window.Sonar) return;

  window.Sonar.show({
    adUnit: (process.env.NEXT_PUBLIC_SONAR_UNIT_NAME ||
      'feed_ad_view') as string, // Замените {bannerAdUnitName} на актуальное

    loader: true, // опционально, можно включать или отключать показ лоадера перед показом рекламы. По-умолчанию: true

    onStart: () => {
      // Добавьте логику для момента начала загрузки рекламы
    },

    onShow: () => {
      // Добавьте логику для момента, когда реклама становится видимой пользователю
    },

    onError: () => {
      // Обработайте ошибки, которые могут возникнуть во время жизненного цикла рекламы
    },

    onClose: () => {
      // Добавьте логику для момента, когда объявление закрылось (например, возобновить контент, показать следующую страницу)
    },
  }).then((result) => {
    // Здесь вы также можете обработать результат попытки показа рекламы с помощью Promise
    if (result.status === 'error') {
      console.error('Failed to show ad'); // Лог ошибки, если что-то пошло не так
    } else {
      console.log('Ad shown'); // Лог успешного показа
    }
  });
};
